<a href="https://colab.research.google.com/github/Bluelord/ML_Cookbook/blob/main/Data_Wrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Data Wrangling**

In [19]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [20]:
import pandas as pd

# Create DataFrame
dataframe = pd.DataFrame()

# Add columns
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

# Show DataFrame
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [21]:
# Create row
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])
# Appending row
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [22]:
# Loading our data 
dataframe = pd.read_csv("/content/drive/MyDrive/Colab Notebooks/ML Cookbook/Datasets/titanic.csv")

print("Head of a data: \n{}\n" .format(dataframe.head()))
print("shape of our data: \n{}\n" .format(dataframe.shape))
print("Statistic describetion of any neumaric columns: \n{}".format(dataframe.describe()))

Head of a data:
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

shape of our data:
(891, 12)

Statistic describetion of any neumaric columns:
       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [23]:
# Navigating the dataframe

print("select the first row of a data: \n{}\n" .format(dataframe.iloc[0]))
print("select the rows within an interval: \n{}" .format(dataframe.iloc[1:4]))

select the first row of a data:
PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

select the rows within an interval:
   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S

[3 rows x 12 columns]

In [24]:
# Set index
dataframe = dataframe.set_index(dataframe['PassengerId'])
# Show row
dataframe.loc[4]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                      35
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 4, dtype: object

DataFrame indexes can be unique string or costomer number. To select individual rows and slices of rows, pandas hs two methods:

*   loc is useful when the index of the DataFrame is a lable (e.g string)
*   iloc works by looking for the the position in th dataframe.

In [27]:
# Selecting based on conditionals

print("First 4 rows where column 'Purchased' is 'Yes': \n{}" 
      .format(dataframe[dataframe['Sex']=='female'].head(4)))

print("Filter rows where column 'Purchased' is 'Yes' & Age >=30: \n{}" 
      .format(dataframe[(dataframe['Sex']=='male') & (dataframe['Age']>=30)].head(7)))

First 4 rows where column 'Purchased' is 'Yes':
             PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
PassengerId                                 ...
2                      2         1       1  ...  71.2833   C85         C
3                      3         1       3  ...   7.9250   NaN         S
4                      4         1       1  ...  53.1000  C123         S
9                      9         1       3  ...  11.1333   NaN         S

[4 rows x 12 columns]
Filter rows where column 'Purchased' is 'Yes' & Age >=30:
             PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
PassengerId                                 ...
5                      5         0       3  ...   8.0500   NaN         S
7                      7         0       1  ...  51.8625   E46         S
14                    14         0       3  ...  31.2750   NaN         S
21                    21         0       2  ...  26.0000   NaN         S
22                    22         1       2  ...  13.0000   D56         S
31                    31         0       1  ...  27.7208   NaN         C
34                    34         0       2  ...  10.5000   NaN         S

[7 rows x 12 columns]

In [33]:
# replacing Vlaues

print("Replace values: \n{}" 
      .format(dataframe['Sex'].replace("female",0).head(5)))

print("Replace multiple values: \n{}" 
      .format(dataframe['Sex'].replace(["female", "male"],[0,1])))

Replace values:
PassengerId
1    male
2       0
3       0
4       0
5    male
Name: Sex, dtype: object
Replace multiple values:
PassengerId
1      1
2      0
3      0
4      0
5      1
      ..
887    1
888    0
889    0
890    1
891    1
Name: Sex, Length: 891, dtype: int64

In [34]:
# Renaming Columns

print("Rename column: \n{}\n" 
      .format(dataframe.rename(columns={'Pclass': 'Passenger_class'}).head(5)))


print("Rename columns: \n{}\n" 
      .format(dataframe.rename(columns={'Pclass': 'Passenger_class', 'Sex': 'Gender'}).head(5)))

# If we want a to rename all the column at once at the initial 
names = ('Nation', 'Years', 'Sal','Bought-or-not')
data = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/ML Cookbook/Datasets/Data.csv', names=names)
print(data)

Rename column:
             PassengerId  Survived  Passenger_class  ...     Fare Cabin  Embarked
PassengerId                                          ...
1                      1         0                3  ...   7.2500   NaN         S
2                      2         1                1  ...  71.2833   C85         C
3                      3         1                3  ...   7.9250   NaN         S
4                      4         1                1  ...  53.1000  C123         S
5                      5         0                3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Rename columns:
             PassengerId  Survived  Passenger_class  ...     Fare Cabin  Embarked
PassengerId                                          ...
1                      1         0                3  ...   7.2500   NaN         S
2                      2         1                1  ...  71.2833   C85         C
3                      3         1                3  ...   7.9250   NaN         S
4                      4         1                1  ...  53.1000  C123         S
5                      5         0                3  ...   8.0500   NaN         S

[5 rows x 12 columns]

     Nation Years     Sal Bought-or-not
0   Country   Age  Salary     Purchased
1    France    44   72000            No
2     Spain    27   48000           Yes
3   Germany    30   54000            No
4     Spain    38   61000            No
5   Germany    40     NaN           Yes
6    France    35   58000           Yes
7     Spain   NaN   52000            No
8    France    48   79000           Yes
9   Germany    50   83000            No
10   France    37   67000           Yes

In [35]:
# Calculate statistics

print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 80.0
Minimum: 0.42
Mean: 29.69911764705882
Sum: 21205.17
Count: 714

In addition to the statistics used in the solution, pandas offers variance (var), standarddeviation (std), kurtosis (kurt), skewness (skew), standard error of the mean (sem), mode (mode), median (median), and a number of others.

In [50]:
# Select unique values
print("slecting unique values in a feature: {}\n" 
      .format(dataframe['Sex'].unique()))

# Show counts
print("counting each types of values in a feature: \n{}\n" 
      .format(dataframe['Sex'].value_counts()))

# Show number of unique values
print("Number of Unique values: \n{}" 
      .format(dataframe['Pclass'].nunique()))

slecting unique values in a feature: ['male' 'female']

counting each types of values in a feature:
male      577
female    314
Name: Sex, dtype: int64

Number of Unique values:
3

Both unique and value_counts are useful for manipulating and exploring categorical columns. Very often in categorical columns there will be classes that need to be handled in the data wrangling phase.

In [59]:
# Handling Missing Values 

## Select missing values, show two rows
dataframe[dataframe['Age'].isnull()]

             PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
PassengerId                                 ...
6                      6         0       3  ...   8.4583   NaN         Q
18                    18         1       2  ...  13.0000   NaN         S
20                    20         1       3  ...   7.2250   NaN         C
27                    27         0       3  ...   7.2250   NaN         C
29                    29         1       3  ...   7.8792   NaN         Q
...                  ...       ...     ...  ...      ...   ...       ...
860                  860         0       3  ...   7.2292   NaN         C
864                  864         0       3  ...  69.5500   NaN         S
869                  869         0       3  ...   9.5000   NaN         S
879                  879         0       3  ...   7.8958   NaN         S
889                  889         0       3  ...  23.4500   NaN         S

[177 rows x 12 columns]

Missing values are a ubiquitous problem in data wrangling, yet many underestimate the difficulty of working with missing data. pandas uses NumPy’s NaN (“Not A Number”) value to denote missing values, but it is important to note that NaN is not fully implemented natively in pandas.

In [60]:
# Attempt to replace values with NaN
dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: ignored

In [61]:
# Using numpy for replacing value with NaN
import numpy as np
# Replace values with NaN
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [67]:
# Deleting column

print("Deleting Single column: \n{}\n" 
      .format(dataframe.drop('Age', axis=1).head()))

# Drop columns
print("Deleting multiple columns: \n{}\n" 
      .format(dataframe.drop(['Age', 'Sex'], axis=1).head()))

# If a column does not have a name, you can drop it by
# its column index using dataframe.columns:

print("Deleting column with its index: \n{}" 
      .format(dataframe.drop(dataframe.columns[1], axis=1).head()))

Deleting Single column:
             PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
PassengerId                                 ...
1                      1         0       3  ...   7.2500   NaN         S
2                      2         1       1  ...  71.2833   C85         C
3                      3         1       3  ...   7.9250   NaN         S
4                      4         1       1  ...  53.1000  C123         S
5                      5         0       3  ...   8.0500   NaN         S

[5 rows x 11 columns]

Deleting multiple columns:
             PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
PassengerId                                 ...
1                      1         0       3  ...   7.2500    NaN         S
2                      2         1       1  ...  71.2833    C85         C
3                      3         1       3  ...   7.9250    NaN         S
4                      4         1       1  ...  53.1000   C123         S
5                      5         0       3  ...   8.0500    NaN         S

[5 rows x 10 columns]

Deleting column with its index:
             PassengerId  Pclass  ... Cabin Embarked
PassengerId                       ...
1                      1       3  ...   NaN        S
2                      2       1  ...   C85        C
3                      3       3  ...   NaN        S
4                      4       1  ...  C123        S
5                      5       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
# Deleting rows

print("Deleting rows which has Female data: \n{}\n" 
      .format(dataframe[dataframe['Sex'] != 'female'].head()))

Technically you can use the drop method (for example, df.drop([0, 1],
axis=0) to drop the first two rows), a more practical method is simply to wrap a
boolean condition inside df[]. The reason is because we can use the power of conditionals to delete either a single row or (far more likely) many rows at once.

In [75]:
# Dropping duplicate Rows

print("Dropping dublicate values from our dataset: \n{}\n" 
      .format(dataframe.drop_duplicates()))

# The output show we don't have any dublicate rows as
# no of samples remains same after exicuting it.

# Show number of rows
print("Number Of Rows In The Original DataFrame:\n", len(dataframe))
print("Number Of Rows After Deduping:\n", len(dataframe.drop_duplicates()))

Dropping dublicate values from our dataset:
             PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
PassengerId                                 ...
1                      1         0       3  ...   7.2500   NaN         S
2                      2         1       1  ...  71.2833   C85         C
3                      3         1       3  ...   7.9250   NaN         S
4                      4         1       1  ...  53.1000  C123         S
5                      5         0       3  ...   8.0500   NaN         S
...                  ...       ...     ...  ...      ...   ...       ...
887                  887         0       2  ...  13.0000   NaN         S
888                  888         1       1  ...  30.0000   B42         S
889                  889         0       3  ...  23.4500   NaN         S
890                  890         1       1  ...  30.0000  C148         C
891                  891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Number Of Rows In The Original DataFrame:
 891
Number Of Rows After Deduping:
 891

In [85]:
# Grouping rows by values
 
print("Mean of all other attributes which have survived:\n{}\n" 
      .format(dataframe.groupby('Survived').mean()))

# Grouping and counting who have survived or not in PassengerId
print("Counting the survived and not-survived:\n{}\n" 
      .format(dataframe.groupby('Survived')['PassengerId'].count()))

# Groupping Gender then grouping them who have survived or not and calculating mean of their age
print("Mean of age of a genders who have survived or not: \n{}" 
      .format(dataframe.groupby(['Sex','Survived'])['Age'].mean()))

Mean of all other attributes which have survived:
          PassengerId    Pclass        Age     SibSp     Parch       Fare
Survived
0          447.016393  2.531876  30.626179  0.553734  0.329690  22.117887
1          444.368421  1.950292  28.343690  0.473684  0.464912  48.395408

Counting the survived and not-survived:
Survived
0    549
1    342
Name: PassengerId, dtype: int64

Mean of age of a genders who have survived or not:
Sex     Survived
female  0           25.046875
        1           28.847716
Name: Age, dtype: float64

In [87]:
# Grouping Row by time

# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
# Create DataFrame
dataframe = pd.DataFrame(index=time_index)
# Create column of random values
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)

# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86089
2017-06-18       100997
2017-06-25       100647
2017-07-02       100859
2017-07-09       101399
2017-07-16        10411

Notice that the date and time of each sale is the index of the DataFrame; this is because resample requires the index to be datetime-like values.
Using resample we can group the rows by a wide array of time periods (offsets) and then we can calculate some statistic on each time group:

In [89]:
# Group by two weeks, calculate mean
print("# Group by two weeks and calculating mean: \n{}\n" 
      .format(dataframe.resample('2W').mean()))

# Group by month, count rows
print("Group by month and counting rows: \n{}\n" 
      .format(dataframe.resample('M').count()))

# Group by two weeks and calculating mean:
            Sale_Amount
2017-06-11     4.982002
2017-06-25     5.001091
2017-07-09     5.016319
2017-07-23     5.005288

Group by month and counting rows:
            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [ ]:
# Looping Over a Column

for name in dataframe['PassengerId'][0:5]:
  print(name.upper())

In [ ]:
# Applying function over all the column

def upper(x):
  return x.upper()

data['Country'].apply(upper)[0:5]

In [ ]:
# Apply a functon to Group

data.groupby('Purchased').apply(lambda x: x.count())